#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Harmeek-Training/week-16-sentinel-enforcement/runs/run-eXNw9Vou86ZqVyqN

Waiting for the plan to start...

Terraform v1.14.0
on linux_amd64
Initializing plugins and modules...
module.logs_bucket.aws_s3_bucket.this: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251201065357]
module.demo_bucket.aws_s3_bucket.this: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251201065357]
module.logs_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251201065357]
module.logs_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251201065357]
module.logs_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251201065357]
module.demo_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251201065357]
module.demo_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251201065357]
module.demo_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251201065357]
module.logs_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251201065357,log-delivery-write]
module.demo_bucket.aws_s3_bucket.this: Drift detected (update)
module.logs_bucket.aws_s3_bucket.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.demo_bucket.aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)
      ~ bucket                      = "week-16-sentinel-cicd-demo-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "week-16-sentinel-cicd-demo-dev-20251201065357.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "week-16-sentinel-cicd-demo-dev-20251201065357.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          - "BucketType"  = "demo"
          - "Compliance"  = "CIS-AWS-Foundations"
          - "CostCenter"  = "Training"
          - "CreatedDate" = "2025-12-01T06:53:57Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Module"      = "aws-s3"
          - "Name"        = "Week-16 Demo Bucket"
          - "Owner"       = "harmeek083@gmail.com"
          - "Project"     = "Demonstrate CI/CD pipeline with Sentinel policies"
        } -> (known after apply)
      ~ tags_all                    = {
          - "BucketType"  = "demo"
          - "Compliance"  = "CIS-AWS-Foundations"
          - "CostCenter"  = "Training"
          - "CreatedDate" = "2025-12-01T06:53:57Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Module"      = "aws-s3"
          - "Name"        = "Week-16 Demo Bucket"
          - "Owner"       = "harmeek083@gmail.com"
          - "Project"     = "Demonstrate CI/CD pipeline with Sentinel policies"
          - "Repository"  = "week-16-sentinel-cicd"
        } -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.demo_bucket.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "week-16-sentinel-cicd-demo-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.demo_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket = "week-16-sentinel-cicd-demo-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.demo_bucket.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket = "week-16-sentinel-cicd-demo-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.logs_bucket.aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)
      ~ bucket                      = "week-16-sentinel-cicd-logs-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "week-16-sentinel-cicd-logs-dev-20251201065357.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "week-16-sentinel-cicd-logs-dev-20251201065357.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          - "BucketType"  = "logs"
          - "Compliance"  = "CIS-AWS-Foundations"
          - "CostCenter"  = "Training"
          - "CreatedDate" = "2025-12-01T06:53:57Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Module"      = "aws-s3"
          - "Name"        = "Week-16 Logs Bucket"
          - "Owner"       = "harmeek083@gmail.com"
          - "Project"     = "Ready for access logs from other buckets"
        } -> (known after apply)
      ~ tags_all                    = {
          - "BucketType"  = "logs"
          - "Compliance"  = "CIS-AWS-Foundations"
          - "CostCenter"  = "Training"
          - "CreatedDate" = "2025-12-01T06:53:57Z"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
          - "Module"      = "aws-s3"
          - "Name"        = "Week-16 Logs Bucket"
          - "Owner"       = "harmeek083@gmail.com"
          - "Project"     = "Ready for access logs from other buckets"
          - "Repository"  = "week-16-sentinel-cicd"
        } -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - permissions = [
              - "READ_ACP",
              - "WRITE",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
        }
      - grant {
          - id          = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.logs_bucket.aws_s3_bucket_acl.this[0] must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
      ~ bucket = "week-16-sentinel-cicd-logs-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-logs-dev-20251201065357,log-delivery-write" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ_ACP" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                }
            }
          - grant {
              - permission = "WRITE" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - id = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
            }
        }
    }

  # module.logs_bucket.aws_s3_bucket_ownership_controls.this[0] must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "this" {
      ~ bucket = "week-16-sentinel-cicd-logs-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.logs_bucket.aws_s3_bucket_public_access_block.this[0] must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "week-16-sentinel-cicd-logs-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.logs_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket = "week-16-sentinel-cicd-logs-dev-20251201065357" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 0 to change, 9 to destroy.

Changes to Outputs:
  ~ demo_bucket_arn                = "arn:aws:s3:::week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)
  ~ demo_bucket_console_url        = "https://s3.console.aws.amazon.com/s3/buckets/week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)
  ~ demo_bucket_name               = "week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)
  ~ demo_bucket_region             = "us-east-1" -> (known after apply)
  ~ demo_bucket_url                = "https://week-16-sentinel-cicd-demo-dev-20251201065357.s3.amazonaws.com" -> (known after apply)
  ~ deployment_summary             = {
      ~ demo_bucket        = "week-16-sentinel-cicd-demo-dev-20251201065357" -> (known after apply)
      ~ logs_bucket        = "week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)
        # (8 unchanged attributes hidden)
    }
  ~ logs_bucket_arn                = "arn:aws:s3:::week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)
  ~ logs_bucket_console_url        = "https://s3.console.aws.amazon.com/s3/buckets/week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)
  ~ logs_bucket_name               = "week-16-sentinel-cicd-logs-dev-20251201065357" -> (known after apply)
  ~ logs_bucket_url                = "https://week-16-sentinel-cicd-logs-dev-20251201065357.s3.amazonaws.com" -> (known after apply)

Post-plan Tasks:

OPA Policy Evaluation

→→ Overall Result: PASSED (with advisory)
 This result means that all OPA policies passed and the protected behavior is allowed
5 policies evaluated

→ Policy set 1: week-15-cis-advanced (5)
  ↳ Policy name: cloudtrail-enabled.sentinel
     | ✓ Passed
     | ============================================================================
CloudTrail Enabled Policy
============================================================================
CIS Control: 3.1
Purpose: Ensure CloudTrail is enabled in all regions
Security Risk: Without CloudTrail, no audit trail of AWS API calls exists
Enforcement: Hard-mandatory (compliance requirement)
============================================================================
  ↳ Policy name: critical-security-controls.sentinel
     | ✓ Passed
     | ============================================================================
Composite Critical Security Controls Policy
============================================================================
  ↳ Policy name: mandatory-tagging.sentinel
     | Ⓘ Advisory
     | ============================================================================
Mandatory Tagging Policy
============================================================================
  ↳ Policy name: restrict-ssh-access.sentinel
     | ✓ Passed
     | ============================================================================
SSH Access Restriction Policy
============================================================================
CIS Control: 5.1
Purpose: Ensure security groups do not allow unrestricted SSH access (0.0.0.0/0)
Security Risk: Open SSH port 22 exposes servers to brute force attacks
Enforcement: Hard-mandatory (critical security control)
============================================================================
  ↳ Policy name: s3-ecnryption-required.sentinel
     | ✓ Passed
     | ============================================================================
S3 Encryption Required Policy
============================================================================
Control: CIS AWS Foundations Benchmark 2.1.1
Purpose: Ensure all S3 buckets have encryption enabled
Enforcement: Advisory (warning only)
============================================================================

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Pusher**: @Harmeek-19
**Action**: pull_request
**Working Directory**: `week-16-sentinel-cicd/terraform`
**Workflow**: `Terraform Plan`

---

### 🛡️ Sentinel Policy Checks

Policy results are available in [Terraform Cloud](Harmeek-Training/workspaces/week-16-sentinel-enforcement/runs)

- Check policies passed/failed
- Review enforcement levels
- View detailed policy output
